{
  "title": "What constrains food webs? A maximum entropy framework for predicting their structure with minimal biases",
  "license": "CC-BY",
  "language": "en",
  "creators": [
    {
      "affiliations": [
        "Université de Montréal",
        "Université de Sherbrooke",
        "Quebec Centre for Biodiversity Science"
      ],
      "familyname": "Banville",
      "givennames": "Francis",
      "email": "francis.banville@umontreal.ca",
      "orcid": "0000-0001-9051-0597",
      "status": ["corresponding"]
    },
    {
      "affiliations": [
        "Université de Sherbrooke",
        "Quebec Centre for Biodiversity Science"
      ],
      "familyname": "Gravel",
      "givennames": "Dominique",
      "email": "dominique.gravel@usherbrooke.ca",
      "orcid": "0000-0002-4498-7076"
    },
    {
      "affiliations": [
        "Université de Montréal",
        "Quebec Centre for Biodiversity Science"
      ],
      "familyname": "Poisot",
      "givennames": "Timothée",
      "email": "timothee.poisot@umontreal.ca",
      "orcid": "0000-0002-0735-5184"
    }
  ],
  "description": "Food webs are complex ecological networks whose structure is both ecologically and statistically constrained, with many network properties being correlated with each other. Despite the recognition of these invariable relationships in food webs, the use of the principle of maximum entropy (MaxEnt) in network ecology is still rare. This is surprising considering that MaxEnt is a renowned and rigorous statistical tool precisely designed for understanding and predicting many different types of constrained systems. Precisely, this principle asserts that the least-biased probability distribution of a system's property, constrained by prior knowledge about that system, is the one with maximum information entropy. MaxEnt has been proven useful in many ecological modelling problems, but its application in food webs and other ecological networks is limited. Here we show how MaxEnt can be used to derive many food-web properties both analytically and heuristically. First, we show how the joint degree distribution (the joint probability distribution of the numbers of prey and predators for each species in the network) can be derived analytically using the number of species and the number of interactions in food webs. Second, we present a heuristic and flexible approach of finding a network's adjacency matrix (the network's representation in matrix format) based on simulated annealing and SVD entropy. We built two heuristic models using the connectance and the joint degree sequence as statistical constraints, respectively. We compared both models' predictions against corresponding null and neutral models commonly used in network ecology using open access data of terrestrial and aquatic food webs sampled globally (N = 257). We found that the heuristic model constrained by the joint degree sequence was a good predictor of many measures of food-web structure, especially the nestedness and motifs distribution. Specifically, our results suggest that the structure of terrestrial and aquatic food webs is mainly driven by their joint degree distribution.",
  "keywords": [
    "ecological modelling",
    "ecological networks",
    "food webs",
    "maximum entropy",
    "null models"
  ]
}
