{
  "title": "Maximum entropy modelling of food-web structure",
  "license": "CC-BY",
  "language": "en",
  "creators": [
    {
      "affiliations": [
        "Université de Montréal",
        "Université de Sherbrooke",
        "Quebec Centre for Biodiversity Science"
      ],
      "familyname": "Banville",
      "givennames": "Francis",
      "email": "francis.banville@umontreal.ca",
      "orcid": "0000-0001-9051-0597",
      "status": ["corresponding"]
    },
    {
      "affiliations": [
        "Université de Sherbrooke",
        "Quebec Centre for Biodiversity Science"
      ],
      "familyname": "Gravel",
      "givennames": "Dominique",
      "email": "dominique.gravel@usherbrooke.ca",
      "orcid": "0000-0002-4498-7076"
    },
    {
      "affiliations": [
        "Université de Montréal",
        "Quebec Centre for Biodiversity Science"
      ],
      "familyname": "Poisot",
      "givennames": "Timothée",
      "email": "timothee.poisot@umontreal.ca",
      "orcid": "0000-0002-0735-5184"
    }
  ],
  "description": "The principle of maximum entropy is a rigorous mathematical method of finding constrained probability distributions that has been proven useful in many ecological modelling problems. However, despite its broad application in graph and network theory, it has seldom been used to model ecological networks. Here we show how the (joint) degree distribution of maximum entropy can be directly derived using the number of species and the number of links in terrestrial and aquatic food webs. We also present a heuristic and flexible approach of finding the network of maximum entropy based on simulating annealing and SVD entropy. We built two of these network-level models using constraints given by the connectance and the joint degree sequence, respectively. All maximum entropy models were compared against open access food-web data and null and neutral models commonly used in network ecology. We found that the maximum entropy network model constrained by the joint degree sequence was a good predictor of food-web structure, including nestedness and motifs distribution. Overall, our results suggest that many properties of ecological networks are mainly driven by the joint degree distribution and statistical phenomena.",
  "keywords": [
    "ecological modelling",
    "ecological networks",
    "food webs",
    "maximum entropy",
    "null models"
  ]
}
